[
  {
    "date": "2025-11-01",
    "projects": [
      {
        "name": "zkEnc: Witness Encryption for Circom Circuits",
        "url": "https://zkenc.limaois.me/",
        "type": "开源",
        "tags": [
          "zkEnc",
          "Witness Encryption",
          "Circom"
        ],
        "summary": {
          "zh": "@billwu1999 发布了zkEnc开源项目，包括基于Circom定义解密条件、支持R1CS等特性，允许在终端、Node.js和浏览器中实现高性能加密。",
          "en": "@billwu1999 released zkEnc open source project, including based on Circom defining decryption conditions, supporting R1CS, allowing high-performance encryption in terminal, Node.js and browser."
        },
        "notes": {
          "zh": [
            "见证加密允许加密到计算语句，而非密钥",
            "使用Circom电路定义解密条件，支持R1CS",
            "可在终端、Node.js和浏览器中部署",
            "基于Rust和WASM实现高性能",
            "无需密钥交换或可信第三方",
            "强调可验证计算和隐私安全",
            "作者已澄清该工作仍无法证明安全性。[链接](https://x.com/billwu1999/status/1985375556226224252)"
          ],
          "en": [
            "Witness encryption allows encryption to computation statements, not keys",
            "Using Circom circuits to define decryption conditions, supporting R1CS",
            "Can be deployed in terminal, Node.js, and browser",
            "Based on Rust and WASM for high performance",
            "No key exchange or trusted third party required",
            "Emphasizing verifiable computation and privacy security",
            "Author clarified the work's security remains unproven. [Link](https://x.com/billwu1999/status/1985375556226224252)"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-03",
    "projects": [
      {
        "name": "Anchored Merkle Range Proof for Pedersen Commitments",
        "url": "https://eprint.iacr.org/2025/1811",
        "type": "论文",
        "tags": [
          "Leona Hioki",
          "Pedersen Commitment"
        ],
        "summary": {
          "zh": "来自Intmax的Leona Hioki在{{name}}论文中提出了一种基于Merkle树的Pedersen承诺范围证明机制，通过锚定和轻量级验证避免ZK验证和配对运算，降低交易成本。",
          "en": "Leona Hioki from Intmax proposed a range proof mechanism for Pedersen commitments based on Merkle trees, avoiding ZK verification and pairings, reducing transaction costs."
        },
        "notes": {
          "zh": [
            "避免每笔交易的重ZK验证和配对运算，降低计算开销",
            "使用Merkle树和锚定机制确保范围证明的隐私性",
            "结合DLEQ和Schnorr证明强化安全性",
            "验证成本低，仅需Merkle证明、DLEQ和Schnorr证明",
            "适用于EVM环境，优化gas使用",
            "预印本形式发布，尚未正式同行评审"
          ],
          "en": [
            "Avoids repeated ZK verification and pairings in each transaction, reducing computational overhead",
            "Uses Merkle trees and anchor mechanism to ensure privacy of range proofs",
            "Combines DLEQ and Schnorr proofs for enhanced security",
            "Verification cost is low, requiring only Merkle proofs, DLEQ, and Schnorr proofs",
            "Suitable for EVM environment, optimizing gas usage",
            "Preprint form, not yet peer-reviewed"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-04",
    "projects": [
      {
        "name": "zk-Cookies: Continuous Anonymous Authentication for the Web",
        "url": "https://eprint.iacr.org/2025/1938",
        "type": "论文",
        "tags": [
          "Alexander Frolov",
          "Anonymous Credentials"
        ],
        "summary": {
          "zh": "Frolov等人在{{name}}论文中提出了一种连续匿名认证方案(CAA) zk-Cookies，使用zkSNARKs实现高效行为信号分析，防止凭证共享和盗窃，并支持差分隐私。",
          "en": "Frolov et al. proposed a continuous anonymous authentication (CAA) scheme named zk-Cookies in their paper {{name}}, which utilizes zkSNARKs for efficient behavior signal analysis to prevent credential sharing and theft, and supports differential privacy."
        },
        "notes": {
          "zh": [
            "CAA方案将行为信号处理移至客户端，减少服务器数据收集",
            "使用zkSNARKs实现高效计算和隐私保护",
            "支持IP地址、地理位置、浏览器指纹等常见行为信号",
            "原型应用用于基于传统凭证的年龄验证",
            "集成差分隐私分析，提升数据安全性",
            "计算性能优化，更新操作在200毫秒内完成"
          ],
          "en": [
            "Shifts behavior signal processing to the client, reducing server data collection",
            "Utilizes zkSNARKs for efficient computation and privacy protection",
            "Supports common behavior signals such as IP addresses, geolocation, and browser fingerprints",
            "Prototype application for age verification based on traditional credentials",
            "Integrates differential privacy analysis to enhance data security",
            "Performance optimization, updating operations completed in 200 milliseconds"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-05",
    "projects": [
      {
        "name": "Cryptographic Personas: Responsible Pseudonyms Without De-Anonymization",
        "url": "https://eprint.iacr.org/2025/1969",
        "type": "论文",
        "tags": [
          "Rachel Thomas",
          {
            "zh": "匿名消息",
            "en": "Anonymous Messaging"
          }
        ],
        "summary": {
          "zh": "Thomas等人在{{name}}论文中提出了加密角色系统，支持用户在社区中创建不可链接的匿名身份，并在违反规范时撤销匿名发布能力，通过离线证明生成和证明折叠技术优化实时应用性能。",
          "en": "Thomas et al. proposed a cryptographic personas system in their paper {{name}}, which supports users in creating unlinkable anonymous identities in communities and revoking anonymous publishing capabilities when users violate rules, optimizing real-time application performance through offline proof generation and proof folding."
        },
        "notes": {
          "zh": [
            "提出可撤销匿名权的“Cryptographic Personas”，实现负责任的匿名发言。",
            "基于 zk-promises 构建可更新状态的匿名凭证体系。",
            "利用 Privacy Pass 将证明生成离线化，显著降低延迟。",
            "采用 Proof Folding 优化服务器验证性能。",
            "在 Signal 群聊中实现原型验证其实用性。",
            "平衡匿名自由与社群治理的密码学方案。"
          ],
          "en": [
            "Proposes 'Cryptographic Personas' for revocable, responsible anonymity.",
            "Builds a stateful anonymous credential system on zk-promises.",
            "Uses Privacy Pass to offline proof generation and cut latency.",
            "Applies Proof Folding to boost server efficiency.",
            "Implements a prototype in Signal group chats.",
            "Balances anonymity and community accountability cryptographically."
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-08",
    "projects": [
      {
        "name": "Sum-check Is All You Need: An Opinionated Survey on Fast Provers in SNARK Design",
        "url": "https://eprint.iacr.org/2025/2041",
        "type": "论文",
        "tags": [
          "Justin Thaler",
          "sum-check",
          "zkVMs"
        ],
        "slogan": {
          "zh": "【ZK论文】\n为什么所有高性能 SNARK 都离不开 Sum-check？\nJustin Thaler 告诉你"
        },
        "summary": {
          "zh": "Justin Thaler在{{name}}论文中分析了sum-check协议在快速SNARK设计中的应用，强调其通过批处理评估、内存检查等技术最小化证明者工作。",
          "en": "Justin Thaler in {{name}} paper analyzed the application of sum-check protocol in fast SNARK design, emphasizing its minimization of prover work through batch evaluation and memory checks."
        },
        "notes": {
          "zh": [
            "sum-check协议是快速SNARK设计的核心，能最小化承诺和证明成本",
            "批处理评估和内存检查技术可显著减少证明者工作量",
            "虚拟多项式和稀疏sum-checks方法提升协议效率",
            "小值保持技术优化计算结构利用",
            "该调查强调sum-check在zkVMs等应用中的潜力",
            "论文为SNARK设计提供实用指导，聚焦实际性能提升"
          ],
          "en": [
            "sum-check protocol is the core of fast SNARK design, minimizing commitment and proof costs",
            "Batch evaluation and memory checks significantly reduce prover workloads",
            "Virtual polynomials and sparse sum-checks improve protocol efficiency",
            "Small-value preservation optimizes computational structure utilization",
            "The survey emphasizes the potential of sum-check in zkVMs and other applications",
            "The paper provides practical guidance for SNARK design, focusing on performance improvements"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-09",
    "projects": [
      {
        "name": "On Reed–Solomon Proximity Gaps Conjectures",
        "url": "https://eprint.iacr.org/2025/2046",
        "type": "论文",
        "tags": [
          "Elizabeth Crites",
          "Reed-Solomon Codes"
        ],
        "slogan": {
          "zh": "【ZK论文】\n证伪多个Reed-Solomon邻近间隙猜想，\n影响FRI、DEEP-FRI等SNARK安全"
        },
        "summary": {
          "zh": "Crites和Stewart在{{name}}论文中证伪了多个Reed-Solomon邻近间隙猜想，这些猜想支撑FRI、DEEP-FRI等SNARK系统的安全性与效率，并提出最小修改方案。",
          "en": "Crites and Stewart in {{name}} paper disproved multiple Reed-Solomon proximity gap conjectures, supporting the security and efficiency of FRI, DEEP-FRI, and other SNARK systems, and proposed minimal modifications to meet list decoding capacity bounds."
        },
        "notes": {
          "zh": [
            "证伪多个Reed-Solomon邻近间隙猜想，影响FRI、DEEP-FRI等SNARK安全",
            "提出最小修改方案以符合列表解码容量界限",
            "证明相关协议与列表解码的关联，解决开放问题",
            "可能削弱依赖这些猜想的ZK证明系统安全性",
            "需重新评估现有证明系统的理论基础",
            "为编码理论和ZK领域提供新的研究方向"
          ],
          "en": [
            "Disproved multiple Reed-Solomon proximity gap conjectures, affecting the security of FRI, DEEP-FRI, and other SNARK systems",
            "Proposed minimal modifications to meet list decoding capacity bounds",
            "Proved the relationship between related protocols and list decoding, solving open problems",
            "May weaken the security of ZK proof systems relying on these conjectures",
            "Need to re-evaluate the theoretical foundations of existing proof systems",
            "Provides new research directions for coding theory and ZK"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-10",
    "projects": [
      {
        "name": "Linear-time and Logarithmically-sound Permutation and Multiset SNARKs",
        "url": "https://eprint.iacr.org/2025/1967",
        "type": "论文",
        "tags": [
          "Bing-Jyue Chen",
          "Sumcheck"
        ],
        "slogan": {
          "zh": "【ZK论文】\n从 sum-check 到线性代数，\nSNARK 的优化逻辑正在被重写"
        },
        "summary": {
          "zh": "Chen等人在{{name}}论文中提出了一种线性时间且对数可靠的置换和多重集SNARK，通过线性代数视角消除二次证明开销，无需辅助承诺即可实现高效验证。",
          "en": "Chen et al. proposed a linear-time and logarithmically-sound permutation and multiset SNARK in their {{name}} paper, eliminating quadratic proof overhead through a linear-algebraic perspective, avoiding auxiliary commitments for efficient verification."
        },
        "notes": {
          "zh": [
            "新方法避免辅助承诺，降低可靠性错误风险，增强安全性",
            "线性代数视角使部分评估无额外代数成本，优化性能",
            "支持证明者提供置换，无需预处理，提高灵活性",
            "验证者可O(polylog(n))时间评估置换，减少对证明者依赖",
            "匹配最优证明者下界，确保理论效率",
            "域无关设计扩展应用范围，提升通用性"
          ],
          "en": [
            "New method avoids auxiliary commitments, reducing soundness errors and enhancing security",
            "Linear-algebraic perspective allows partial evaluation without additional algebraic costs, optimizing performance",
            "Supports permutation proofs from provers without preprocessing, enhancing flexibility",
            "Verifiers can evaluate permutations in O(polylog(n)) time, reducing dependency on provers",
            "Matches optimal prover bounds, ensuring theoretical efficiency",
            "Field-independent design extends application scope, improving universality"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-11",
    "projects": [
      {
        "name": "Lagrange interpolation for IQ < 200",
        "url": "https://medium.com/@laurippeltonen/lagrange-interpolation-for-iq-200-8cec1e99647d",
        "type": "博客",
        "tags": [
          "Lauri Peltonen",
          "Polynomials"
        ],
        "slogan": {
          "zh": "【ZK博客】\n别被名字吓到！\n5分钟看懂 Lagrange 插值到底在干嘛"
        },
        "summary": {
          "zh": "Lauri Peltonen在{{name}}博客中分享了Lagrange插值方法的基础知识，包括其定义、步骤和应用，并提及了在ZKP中多项式插值的重要性。",
          "en": "Lauri Peltonen in {{name}} blog shared the basic knowledge of Lagrange interpolation, including its definition, steps, and applications, and mentioned the importance of polynomial interpolation in ZKP."
        },
        "notes": {
          "zh": [
            "Lagrange插值生成唯一最低次多项式通过所有给定点",
            "插值可用于数据恢复，如音频丢失数据填补",
            "在ZKP中，多项式插值支持高效验证和比较",
            "Schwartz-Zippel引理允许通过少数点验证多项式",
            "Lagrange方法简单易懂，适合教学和基础实现",
            "实际应用中，FFT等其他方法可能更高效"
          ],
          "en": [
            "Lagrange interpolation generates the unique lowest degree polynomial through all given points",
            "Interpolation can be used for data recovery, such as audio data recovery",
            "In ZKP, polynomial interpolation supports efficient verification and comparison",
            "Schwartz-Zippel lemma allows verification of polynomials through a few points",
            "Lagrange method is simple and easy to understand, suitable for teaching and basic implementation",
            "In practical applications, other methods such as FFT may be more efficient"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-12",
    "projects": [
      {
        "name": "A Note on Notes: Towards Scalable Anonymous Payments via Evolving Nullifiers and Oblivious Synchronization",
        "url": "https://eprint.iacr.org/2025/2031",
        "type": "论文",
        "tags": [
          "Sean Bowe",
          "Oblivious Synchronization"
        ],
        "slogan": {
          "zh": "【ZK论文】\n为什么匿名支付会‘越用越慢’？\n这篇论文给出突破性解决"
        },
        "summary": {
          "zh": "Bowe和Miers在{{name}}论文中提出了一种通过演化无效器和遗忘同步实现可扩展匿名支付的新技术，允许验证者永久修剪无效器而不影响隐私或用户开销。",
          "en": "Bowe and Miers in {{name}}paper proposed a new technique for scalable anonymous payments via evolving nullifiers and oblivious synchronization, allowing validators to permanently trim nullifiers without affecting privacy or user costs."
        },
        "notes": {
          "zh": [
            "匿名支付协议存在无效器线性增长问题，限制扩展性",
            "演化无效器技术允许永久修剪无效器，不破坏未花费资金",
            "遗忘同步模型使用远程服务生成简洁证明，服务对交易细节不可知",
            "服务仅维护临时状态，用户可自由切换服务",
            "该技术不增加用户计算、带宽或延迟开销",
            "增强隐私保护，防止服务链接用户与交易"
          ],
          "en": [
            "Anonymous payment protocols have linear growth of nullifiers, limiting scalability",
            "Evolutionary nullifiers allow permanent trimming of nullifiers without destroying unspent funds",
            "Oblivious synchronization model uses remote services to generate concise proofs, services are unaware of transaction details",
            "Services maintain temporary states, users can freely switch services",
            "This technology does not increase user computation, bandwidth, or latency costs",
            "Enhances privacy protection, preventing service linking users with transactions"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-13",
    "projects": [
      {
        "name": "Circom Pitfalls Part 2: Output Constraints, Input Assumptions, and Signed Comparisons",
        "url": "https://blog.zksecurity.xyz/posts/circom-pitfalls-2/",
        "type": "博客",
        "tags": [
          "ZKSecurity",
          "Circom",
          "Vulnerabilities"
        ],
        "slogan": {
          "zh": "【ZK博客】\n别掉坑里！\nCircom 三大隐藏漏洞：输出约束、输入假设、比较陷阱"
        },
        "summary": {
          "zh": "@zksecurityXYZ 在{{name}}博客中讨论了Circom电路设计中的常见陷阱，包括输出约束缺失、输入假设未验证和比较运算的符号问题，强调了安全性漏洞的预防措施。",
          "en": "@zksecurityXYZ in {{name}} blog discussed common traps in Circom, including missing output constraints, unverified input assumptions, and signed comparison operators."
        },
        "notes": {
          "zh": [
            "输出约束缺失是常见漏洞源，如IsEqual输出未强制为1可被恶意利用",
            "输入假设未验证可导致AND门输出错误，需添加布尔约束如flag*(flag-1)=0",
            "Circom比较运算符基于有符号整数，val函数映射元素到(-p/2, p/2]区间",
            "大整数模板如BigLessThan输出未约束可允许越界输入，需显式检查输出",
            "安全最佳实践：始终显式约束组件输出和输入，避免依赖隐式假设",
            "比较运算符的有符号语义可能导致p/2 > p/2+1等反直觉结果，需在见证生成时注意"
          ],
          "en": [
            "Output constraints are common vulnerabilities, such as IsEqual output not forced to 1 can be exploited by malicious users",
            "Input assumptions can cause AND gate output errors, need to add boolean constraints like flag*(flag-1)=0",
            "Circom comparison operators are based on signed integers, val function maps elements to (-p/2, p/2] interval",
            "Large integer templates like BigLessThan output without constraints can allow out-of-bound inputs, need to explicitly check outputs",
            "Security best practices: always explicitly constrain component outputs and inputs, avoid relying on implicit assumptions",
            "Comparison operators' signed semantics may cause p/2 > p/2+1 etc. counterintuitive results, need to pay attention to witness generation"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-15",
    "projects": [
      {
        "name": "TensorSwitch: Nearly Optimal Polynomial Commitments from Tensor Codes",
        "url": "https://eprint.iacr.org/2025/2065",
        "type": "论文",
        "tags": [
          "Benedikt Bünz",
          "Tensor Codes"
        ],
        "slogan": {
          "zh": "【ZK论文】\nSNARG 的新基石？\nTensorSwitch 将 PCS 证明大小压到 O(log log n)"
        },
        "summary": {
          "zh": "Bünz等人在{{name}}论文中提出了TensorSwitch，一种基于哈希的多线性多项式承诺方案，显著优化了证明者时间和证明大小，适用于SNARG设计。",
          "en": "Bünz et al. proposed TensorSwitch, a hash-based multi-linear polynomial commitment scheme in paper{{name}}, which significantly optimizes prover time and proof size, suitable for SNARG designs."
        },
        "notes": {
          "zh": [
            "TensorSwitch优化PCS的证明者时间和证明大小，降低ZK证明开销",
            "使用线性码和交互式预言模型，可编译为标准密码学PCS",
            "承诺时间依赖码率ρ和编码时间τ，支持高效场运算",
            "验证时间对数级增长，适合大规模多项式处理",
            "证明大小极小，仅O(log log n)预言，提升可扩展性",
            "基于哈希构建，增强安全性，减少对复杂密码学假设的依赖"
          ],
          "en": [
            "TensorSwitch optimizes the prover time and proof size of PCs to reduce ZK proof overhead",
            "It uses linear codes and interactive predicative models, which can be compiled into standard cryptographic PCs",
            "Commitment time depends on coding rate ρ and encoding time τ, supporting efficient gate operations",
            "Verification time grows logarithmically, suitable for large-scale polynomial processing",
            "Proof size is minimal, only O(log log n) witnesses",
            "Built on hashing for increased security and reduced dependence on complex cryptographic assumptions"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-16",
    "projects": [
      {
        "name": "Vega: Low-Latency Zero-Knowledge Proofs over Existing Credentials",
        "url": "https://eprint.iacr.org/2025/2094",
        "type": "论文",
        "tags": [
          "Darya Kaviani",
          "Srinath Setty",
          "Anonymous Credentials"
        ],
        "slogan": {
          "zh": "【ZK论文】\n折叠重用 + 查找算术化：\nVega 重新定义数字身份中的 ZKP 性能"
        },
        "summary": {
          "zh": "Kaviani和Setty在{{name}}论文中提出Vega系统，利用折叠重用和查找中心化算术化技术，实现低延迟ZKP，无需可信设置，显著提升数字身份验证效率。",
          "en": "Kaviani and Setty proposed Vega system in {{name}} paper, which uses folding reuse and lookup centralized arithmetization to achieve low-latency ZKP, without trusted setup, significantly improving digital identity authentication efficiency."
        },
        "notes": {
          "zh": [
            "Vega无需可信设置，降低安全依赖",
            "折叠重用技术减少重复计算，提升效率",
            "查找中心化算术化优化字段提取和哈希",
            "证明大小和延迟优于现有技术",
            "支持数字身份隐私保护"
          ],
          "en": [
            "Vega does not require a trusted setup, reducing security dependencies",
            "Folding reuse technology reduces repeated calculations, improving efficiency",
            "Lookup centralized arithmetization optimizes field extraction and hashing",
            "Proof size and latency are better than existing technologies",
            "Supports digital identity privacy protection"
          ]
        }
      }
    ]
  },
  {
    "date": "2025-11-17",
    "projects": [
      {
        "name": "Merkle Multi-Proofs",
        "url": "https://xn--2-umb.com/25/merkle-multi-proof/",
        "type": "博客",
        "tags": [
          "Remco Bloemen",
          "Merkle Tree",
          "2π.com"
        ],
        "slogan": {
          "zh": "【ZK博客】\n为什么 Merkle 多证明的大小总在变？\n数学告诉你答案"
        },
        "summary": {
          "zh": "Remco Bloemen在{{name}}博客中分析了Merkle多证明在哈希证明系统中的性能，推导了证明大小和验证者工作量的精确分布，包括期望值、方差和概率质量函数。",
          "en": "Remco Bloemen analyzed the performance of Merkle multi-proofs in hash-based proofs, deriving the exact distribution of proof size and verifier work, including expected values, variances, and probability mass functions."
        },
        "notes": {
          "zh": [
            "Merkle证明是哈希证明系统的核心，影响证明大小和验证者工作量",
            "索引分布为均匀随机有放回抽样，允许精确性能分析",
            "推导了证明大小和验证者工作量的期望值、方差和概率质量函数",
            "支持压缩多证明和纯验证者端实现，提升效率",
            "分析可扩展至非完美树和混合分支树，适应不同向量长度",
            "提供了高效计算方法和近似公式，适用于实际应用场景"
          ],
          "en": [
            "Merkle proofs are the core of hash-based proofs, affecting proof size and verifier work",
            "Index distribution is uniform random sampling with replacement, allowing precise performance analysis",
            "Derived the exact distribution of proof size and verifier work, including expected values, variances, and probability mass functions",
            "Supports compressed multi-proofs and pure verifier-end implementation, improving efficiency",
            "Analysis extends to imperfect trees and mixed branch trees, adapting to different vector lengths",
            "Provides efficient calculation methods and approximate formulas, suitable for practical applications"
          ]
        }
      }
    ]
  }
]